force i_dec 2#0 0ns, 2#1 50ns, 2#10 100ns, 2#100 150ns, 2#1000 200ns, 2#10000 250ns, 2#100000 300ns, 2#1000000 350ns, 2#10000000 400ns, 2#100000000 450ns, 2#1000000000 500ns, 2#10000000000 550ns, 2#100000000000 600ns, 2#1000000000000 650ns, 2#10000000000000 700ns, 2#100000000000000 750ns, 2#1000000000000000 800ns;
run 850ns 

Schematic: подати на вхід В значення Z або X — і подивитись, що буде на виході. 
(Тут потрібно буде поспостерігати, який саме ланцюг вийшов з ладу, і прикинути по схемі, чому.)

Logic expression: вивести одночасно і мінімізований вираз, і немінімізований. Просто буде ще одна лінія на осцилограмі, для немінімізованої функції.

Лабораторна #3:
Encoder: подати не one-hot код на вхід, з більше, ніж однією одиницею в розрядах. Подивитись, як відпрацює. Чисто поспостерігати.

Mux: завдання немає.